{"format": "layers-model", "generatedBy": "keras v2.8.0", "convertedBy": "TensorFlow.js Converter v3.15.0", "modelTopology": {"keras_version": "2.8.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "int64", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding", "trainable": false, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2002, "output_dim": 100, "embeddings_initializer": {"class_name": "Constant", "config": {"value": [[0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [-0.03819400072097778, -0.24487000703811646, 0.7281200289726257, -0.3996100127696991, 0.08317200094461441, 0.043953001499176025, -0.3914099931716919, 0.3343999981880188, -0.5754500031471252, 0.08745899796485901, 0.28786998987197876, -0.06730999797582626, 0.3090600073337555, -0.263839989900589, -0.13231000304222107, -0.20757000148296356, 0.333950012922287, -0.33847999572753906, -0.3174299895763397, -0.4833599925041199, 0.14640000462532043, -0.37303999066352844, 0.345770001411438, 0.05204100161790848, 0.4494599997997284, -0.46970999240875244, 0.026280000805854797, -0.5415499806404114, -0.15518000721931458, -0.14106999337673187, -0.03972199931740761, 0.2827700078487396, 0.14393000304698944, 0.2346400022506714, -0.3102099895477295, 0.08617299795150757, 0.20397000014781952, 0.5262399911880493, 0.17163999378681183, -0.08237800002098083, -0.7178699970245361, -0.41530999541282654, 0.2033499926328659, -0.12762999534606934, 0.41367000341415405, 0.5518699884414673, 0.5790799856185913, -0.33476999402046204, -0.36559000611305237, -0.5485699772834778, -0.06289199739694595, 0.26583999395370483, 0.30204999446868896, 0.9977499842643738, -0.8048099875450134, -3.0243000984191895, 0.012539999559521675, -0.36941999197006226, 2.2167000770568848, 0.7220100164413452, -0.24977999925613403, 0.9213600158691406, 0.03451399877667427, 0.46744999289512634, 1.1079000234603882, -0.1935800015926361, -0.07457499951124191, 0.23352999985218048, -0.05206200107932091, -0.22044000029563904, 0.057162001729011536, -0.1580599993467331, -0.3079800009727478, -0.41624999046325684, 0.379720002412796, 0.1500599980354309, -0.5321199893951416, -0.20550000667572021, -1.2525999546051025, 0.07162400335073471, 0.7056499719619751, 0.49744001030921936, -0.42063000798225403, 0.2614800035953522, -1.5379999876022339, -0.30223000049591064, -0.07343800365924835, -0.2831200063228607, 0.3710399866104126, -0.25216999650001526, 0.016215000301599503, -0.01709900051355362, -0.3898400068283081, 0.874239981174469, -0.7256900072097778, -0.5105800032615662, -0.5202800035476685, -0.14589999616146088, 0.8277999758720398, 0.2706199884414673], [-0.18970000743865967, 0.05002399906516075, 0.1908400058746338, -0.04918399825692177, -0.08973699808120728, 0.2100600004196167, -0.5495200157165527, 0.09837699681520462, -0.20135000348091125, 0.34240999817848206, -0.09267699718475342, 0.16099999845027924, -0.1326799988746643, -0.2815999984741211, 0.18737000226974487, -0.42958998680114746, 0.9603899717330933, 0.13971999287605286, -1.0780999660491943, 0.4051800072193146, 0.5053899884223938, -0.5506399869918823, 0.4844000041484833, 0.38043999671936035, -0.0029054998885840178, -0.3494200110435486, -0.09969600290060043, -0.7836800217628479, 1.0362999439239502, -0.2313999980688095, -0.4712100028991699, 0.5712599754333496, -0.2145400047302246, 0.35958001017570496, -0.48319000005722046, 1.087499976158142, 0.2852399945259094, 0.12447000294923782, -0.03924800083041191, -0.07673200219869614, -0.7634299993515015, -0.32409000396728516, -0.5748999714851379, -1.0893000364303589, -0.4181100130081177, 0.451200008392334, 0.12111999839544296, -0.513670027256012, -0.13348999619483948, -1.1377999782562256, -0.2876800000667572, 0.16774000227451324, 0.5580400228500366, 1.538699984550476, 0.018859000876545906, -2.972100019454956, -0.24216000735759735, -0.9249500036239624, 2.199199914932251, 0.28233999013900757, -0.34779998660087585, 0.5162100195884705, -0.43386998772621155, 0.36851999163627625, 0.7457299828529358, 0.07210200279951096, 0.2793099880218506, 0.9256899952888489, -0.050335999578237534, -0.8585600256919861, -0.13580000400543213, -0.9255099892616272, -0.33991000056266785, -1.0393999814987183, -0.06720300018787384, -0.21378999948501587, -0.47690001130104065, 0.21377000212669373, -0.8400800228118896, 0.052535999566316605, 0.5929800271987915, 0.29603999853134155, -0.6764400005340576, 0.13916000723838806, -1.5504000186920166, -0.20765000581741333, 0.7221999764442444, 0.5205600261688232, -0.07622099667787552, -0.1519400030374527, -0.13133999705314636, 0.0586169995367527, -0.3186900019645691, -0.6141899824142456, -0.6239299774169922, -0.41547998785972595, -0.03817500174045563, -0.3980399966239929, 0.4764699935913086, -0.1598300039768219], [-0.15289999544620514, -0.24278999865055084, 0.8983700275421143, 0.16996000707149506, 0.5351600050926208, 0.4878399968147278, -0.5882599949836731, -0.1798200011253357, -1.3581000566482544, 0.4254100024700165, 0.15376999974250793, 0.24214999377727509, 0.13473999500274658, 0.41192999482154846, 0.6704300045967102, -0.5641800165176392, 0.4298500120639801, -0.012183000333607197, -0.11676999926567078, 0.3178099989891052, 0.05417700111865997, -0.05427300184965134, 0.3551599979400635, -0.3024100065231323, 0.3143399953842163, -0.3384599983692169, 0.7171499729156494, -0.26855000853538513, -0.1583700031042099, -0.4746699929237366, 0.0515809990465641, -0.3325200080871582, 0.1500300019979477, -0.1298999935388565, -0.5461699962615967, -0.37843000888824463, 0.6426100134849548, 0.8218700289726257, -0.08000600337982178, 0.07847899943590164, -0.969760000705719, -0.5774099826812744, 0.5649099946022034, -0.39873000979423523, -0.05709899961948395, 0.19742999970912933, 0.06570599973201752, -0.4809199869632721, -0.20125000178813934, -0.4083400070667267, 0.3945600092411041, -0.026419999077916145, -0.11838000267744064, 1.0119999647140503, -0.5317100286483765, -2.7474000453948975, -0.04298099875450134, -0.7484899759292603, 1.7574000358581543, 0.5908499956130981, 0.04884999990463257, 0.7826700210571289, 0.3849700093269348, 0.42096999287605286, 0.678820013999939, 0.10337000340223312, 0.6327999830245972, -0.02659500017762184, 0.5864700078964233, -0.44332000613212585, 0.3305700123310089, -0.12021999806165695, -0.5564500093460083, 0.07361099869012833, 0.20915000140666962, 0.4339500069618225, -0.012760999612510204, 0.08987399935722351, -1.7991000413894653, 0.08480799943208694, 0.771120011806488, 0.6310499906539917, -0.9068499803543091, 0.6032599806785583, -1.7515000104904175, 0.18595999479293823, -0.5068699717521667, -0.7020300030708313, 0.6657800078392029, -0.813040018081665, 0.1871200054883957, -0.018487999215722084, -0.26756998896598816, 0.7269999980926514, -0.5936300158500671, -0.34839001297950745, -0.5609400272369385, -0.5910000205039978, 1.0039000511169434, 0.20664000511169434], [-0.2708599865436554, 0.04400600120425224, -0.020260000601410866, -0.17395000159740448, 0.6444000005722046, 0.7121300101280212, 0.35510000586509705, 0.47137999534606934, -0.2963699996471405, 0.5442699790000916, -0.7229400277137756, -0.0047611999325454235, 0.04061099886894226, 0.04323599860072136, 0.29728999733924866, 0.10724999755620956, 0.4015600085258484, -0.536620020866394, 0.03338199853897095, 0.06739600002765656, 0.6455600261688232, -0.08552300184965134, 0.14102999866008759, 0.09453900158405304, 0.7494699954986572, -0.1940000057220459, -0.6873900294303894, -0.4174099862575531, -0.22807000577449799, 0.11999999731779099, -0.4899899959564209, 0.8094499707221985, 0.045138001441955566, -0.11897999793291092, 0.2016099989414215, 0.3927600085735321, -0.20121000707149506, 0.3135400116443634, 0.7530400156974792, 0.2590700089931488, -0.11565999686717987, -0.029318999499082565, 0.9349899888038635, -0.3606700003147125, 0.5242000222206116, 0.23705999553203583, 0.5271499752998352, 0.2286899983882904, -0.5195800065994263, -0.7934899926185608, -0.20367999374866486, -0.5018699765205383, 0.18748000264167786, 0.9428200125694275, -0.4483399987220764, -3.6791999340057373, 0.044183000922203064, -0.26750999689102173, 2.199700117111206, 0.2409999966621399, -0.03342499956488609, 0.6955299973487854, -0.6447200179100037, -0.00722770020365715, 0.8957499861717224, 0.2001499980688095, 0.46492999792099, 0.6193299889564514, -0.10660000145435333, 0.08691000193357468, -0.46230000257492065, 0.18262000381946564, -0.15849000215530396, 0.02079099975526333, 0.19372999668121338, 0.06342600286006927, -0.31672999262809753, -0.48177000880241394, -1.3847999572753906, 0.13669000566005707, 0.9685900211334229, 0.04996500164270401, -0.27379998564720154, -0.03568600118160248, -1.0577000379562378, -0.24467000365257263, 0.903659999370575, -0.12442000210285187, 0.08077599853277206, -0.8340100049972534, 0.5720099806785583, 0.08894500136375427, -0.42531999945640564, -0.01825300045311451, -0.07999499887228012, -0.2858099937438965, -0.010889999568462372, -0.49230000376701355, 0.6368700265884399, 0.23642000555992126], [-0.07195299863815308, 0.23127000033855438, 0.02373100072145462, -0.506380021572113, 0.3392300009727478, 0.19589999318122864, -0.3294300138950348, 0.1836400032043457, -0.18057000637054443, 0.2896299958229065, 0.20448000729084015, -0.5496000051498413, 0.2739900052547455, 0.5832700133323669, 0.20467999577522278, -0.4922800064086914, 0.1997399926185608, -0.07023700326681137, -0.8804900050163269, 0.2948499917984009, 0.1407099962234497, -0.10090000182390213, 0.9944900274276733, 0.36972999572753906, 0.44554001092910767, 0.2899799942970276, -0.13760000467300415, -0.5636500120162964, -0.029364999383687973, -0.412200003862381, -0.25268998742103577, 0.6318100094795227, -0.44767001271247864, 0.24363000690937042, -0.10813000053167343, 0.2516399919986725, 0.46966999769210815, 0.37549999356269836, -0.2361299991607666, -0.14128999412059784, -0.44536998867988586, -0.6573699712753296, -0.042420998215675354, -0.2863599956035614, -0.28810998797416687, 0.0637660026550293, 0.20281000435352325, -0.5354200005531311, 0.4130699932575226, -0.5972200036048889, -0.38613998889923096, 0.19389000535011292, -0.17809000611305237, 1.6618000268936157, -0.011819000355899334, -2.373699903488159, 0.05842699855566025, -0.26980000734329224, 1.2822999954223633, 0.8192499876022339, -0.22322000563144684, 0.7293199896812439, -0.05321099981665611, 0.4350700080394745, 0.8501099944114685, -0.42934998869895935, 0.926639974117279, 0.3905099928379059, 1.058500051498413, -0.24560999870300293, -0.18264999985694885, -0.532800018787384, 0.0595179982483387, -0.6601899862289429, 0.18990999460220337, 0.28835999965667725, -0.2433999925851822, 0.5278400182723999, -0.6576200127601624, -0.14080999791622162, 1.0491000413894653, 0.5134000182151794, -0.23815999925136566, 0.6989499926567078, -1.4812999963760376, -0.24869999289512634, -0.17936000227928162, -0.059137001633644104, -0.08055999875068665, -0.48781999945640564, 0.014487000182271004, -0.6258999705314636, -0.32366999983787537, 0.4186199903488159, -1.0807000398635864, 0.4674200117588043, -0.4993099868297577, -0.7189499735832214, 0.868939995765686, 0.1953900009393692], [0.08570300042629242, -0.22201000154018402, 0.16569000482559204, 0.1337299942970276, 0.38238999247550964, 0.3540099859237671, 0.01286999974399805, 0.22461000084877014, -0.4381699860095978, 0.5016400218009949, -0.3587400019168854, -0.3498300015926361, 0.05515599995851517, 0.6964799761772156, -0.17958000302314758, 0.06792599707841873, 0.39100998640060425, 0.1603900045156479, -0.26635000109672546, -0.2113800048828125, 0.5369799733161926, 0.49379000067710876, 0.9366000294685364, 0.6690199971199036, 0.21793000400066376, -0.4664199948310852, 0.22382999956607819, -0.3620400130748749, -0.17655999958515167, 0.17479999363422394, -0.20366999506950378, 0.13931000232696533, 0.019832000136375427, -0.10412999987602234, -0.20243999361991882, 0.550029993057251, -0.15459999442100525, 0.986549973487854, -0.2686299979686737, -0.29089999198913574, -0.3286600112915039, -0.3418799936771393, -0.16943000257015228, -0.4200100004673004, -0.046727001667022705, -0.1632699966430664, 0.7082399725914001, -0.7491099834442139, -0.09155900031328201, -0.9617800116539001, -0.19746999442577362, 0.1028200015425682, 0.5522099733352661, 1.381600022315979, -0.6563599705696106, -3.250200033187866, -0.3155600130558014, -1.2055000066757202, 1.770900011062622, 0.4025999903678894, -0.7982699871063232, 1.1597000360488892, -0.33041998744010925, 0.3138200044631958, 0.773859977722168, 0.22595000267028809, 0.5247099995613098, -0.034053001552820206, 0.32047998905181885, 0.07994800060987473, 0.1775200068950653, -0.4942600131034851, -0.7004500031471252, -0.44569000601768494, 0.17244000732898712, 0.20277999341487885, 0.023291999474167824, -0.20677000284194946, -1.0157999992370605, 0.18324999511241913, 0.567520022392273, 0.31821000576019287, -0.6501100063323975, 0.6827700138092041, -0.8658499717712402, -0.05939200147986412, -0.29264000058174133, -0.5566800236701965, -0.3470500111579895, -0.3289499878883362, 0.4021500051021576, -0.12746000289916992, -0.20227999985218048, 0.8736799955368042, -0.5450000166893005, 0.7920500040054321, -0.20694999396800995, -0.0742729976773262, 0.758080005645752, -0.3424299955368042], [-0.09333699941635132, 0.19043000042438507, 0.6845700144767761, -0.41547998785972595, -0.22777000069618225, -0.11802999675273895, -0.09543400257825851, 0.19612999260425568, 0.17784999310970306, -0.020244000479578972, -0.05540899932384491, 0.3386699855327606, 0.7939599752426147, -0.04712599888443947, 0.4428099989891052, -0.06126600131392479, 0.20795999467372894, 0.03409399837255478, -0.6475099921226501, 0.3587400019168854, 0.1393599957227707, -0.6830999851226807, 0.25595998764038086, -0.12910999357700348, 0.26080000400543213, -0.11674000322818756, 0.024924999102950096, -0.602590024471283, -0.4147399961948395, -0.5110399723052979, 0.14936000108718872, 0.7997699975967407, -0.1271599978208542, 0.40474000573158264, -0.21435000002384186, 0.4703100025653839, 0.49000000953674316, 0.48886001110076904, -0.17771999537944794, -0.1886100023984909, -0.7839099764823914, -0.1415800005197525, 0.22168999910354614, -0.22078000009059906, -0.3050900101661682, -0.10836999863386154, 0.5716800093650818, -0.7832000255584717, -0.16327999532222748, -0.7613099813461304, 0.08087299764156342, 0.0006721700192429125, 0.4471299946308136, 1.343400001525879, -0.20013999938964844, -2.868000030517578, -0.0026469998992979527, -0.39858001470565796, 1.8379000425338745, 1.2210999727249146, -0.1606599986553192, 0.6585299968719482, 0.269459992647171, 0.27211999893188477, 0.947350025177002, 0.24371999502182007, 0.8194000124931335, 0.6773999929428101, 0.06348499655723572, -0.5593400001525879, 0.4554100036621094, -0.64683997631073, -0.03470199927687645, -0.45565998554229736, 0.2184700071811676, -0.05168899893760681, 0.3229900002479553, -0.022960999980568886, -1.7955000400543213, 0.31216999888420105, 0.7622699737548828, -0.23191000521183014, -1.0132999420166016, -0.006437399890273809, -1.8135000467300415, -0.7522100210189819, 0.2836199998855591, -0.3081499934196472, -0.43852999806404114, -0.6265400052070618, 0.1321299970149994, -0.547249972820282, -0.47477999329566956, -0.007972699590027332, -0.15112000703811646, -0.29326000809669495, -0.35117998719215393, -0.6817499995231628, 0.28804001212120056, 0.5489299893379211], [0.13739000260829926, 0.7789099812507629, 0.8005399703979492, 0.13819000124931335, -0.4979200065135956, -0.2612699866294861, -0.15174999833106995, 0.1718599945306778, -0.6841899752616882, 0.5018900036811829, 0.4467200040817261, 0.19672000408172607, -0.4257600009441376, 0.5547400116920471, -0.7796000242233276, 0.030827000737190247, -0.05921100080013275, -0.6166300177574158, 0.1320600062608719, 0.8272299766540527, 0.6158400177955627, -0.48458999395370483, 0.14517000317573547, 0.7999500036239624, 0.08604899793863297, 0.804830014705658, 0.0758960023522377, 0.22578999400138855, 0.4444499909877777, -0.1334500014781952, 0.47720998525619507, 0.907289981842041, -0.16137999296188354, 0.5734699964523315, 0.45350000262260437, 0.18977999687194824, 0.7115200161933899, -0.3466399908065796, -0.21164999902248383, 0.43244001269340515, -0.019108999520540237, -0.3387100100517273, 0.6422500014305115, -0.16962000727653503, 0.041450999677181244, 0.3392600119113922, -0.886210024356842, 0.37560001015663147, 0.5988199710845947, -0.4683000147342682, 0.25760000944137573, 0.17252999544143677, 0.42669999599456787, 0.6077899932861328, -0.6808099746704102, -2.004300117492676, -0.01291900034993887, 0.2617200016975403, 1.2792999744415283, -0.03917500004172325, -0.49851998686790466, -0.4350599944591522, -0.4048500061035156, -0.3525800108909607, 0.8991600275039673, 0.5768200159072876, -0.014538999646902084, 0.19447000324726105, 0.08207199722528458, 0.7535899877548218, -0.0774490013718605, 0.40342000126838684, -0.545930027961731, -0.23555999994277954, 0.5995500087738037, -0.4414600133895874, 0.18016000092029572, -0.04982500150799751, -0.6226000189781189, -0.5519700050354004, 0.34411999583244324, -0.07776600122451782, -0.23914000391960144, -0.3340499997138977, -0.37713000178337097, -0.4099699854850769, -0.41795000433921814, -0.715969979763031, 0.7747799754142761, -0.033215999603271484, -0.01488099992275238, 0.9446300268173218, 0.39169999957084656, 0.21046000719070435, 0.04367399960756302, 0.24270999431610107, 0.046411000192165375, -0.6167600154876709, 0.4470300078392029, -0.27967000007629395], [-0.21863000094890594, -0.42664000391960144, 0.519599974155426, 0.00431030010804534, 0.5804499983787537, -0.1087300032377243, -0.3772599995136261, 0.45660001039505005, -0.6062700152397156, -0.07577300071716309, 0.11305999755859375, 0.17702999711036682, 0.16050000488758087, 0.0745140016078949, 0.636489987373352, -0.07885199785232544, 0.7526800036430359, -0.2496200054883957, -0.5162799954414368, -0.33348000049591064, 0.6675400137901306, -0.34182998538017273, 0.6131600141525269, 0.31668001413345337, 0.6484599709510803, -0.07931199669837952, -0.06521899998188019, -0.17718000710010529, -0.3243899941444397, 0.5186799764633179, -0.23423999547958374, 0.34380999207496643, 0.04685100167989731, 0.7402499914169312, -0.47005000710487366, 0.5368499755859375, -0.3554899990558624, 0.407370001077652, -0.09342099726200104, -0.1343899965286255, -0.41969001293182373, -0.3004100024700165, 0.2864600121974945, 0.37419000267982483, -0.4605399966239929, -0.3070000112056732, -0.38580000400543213, -0.6931700110435486, -0.0009246100089512765, -0.6198400259017944, 0.11977999657392502, 0.14949999749660492, 0.17833000421524048, 1.5312999486923218, -0.9244499802589417, -3.042799949645996, 0.030760999768972397, -0.643589973449707, 2.3824000358581543, 0.5621899962425232, -0.5602099895477295, 1.0263999700546265, -0.45142999291419983, 0.14116999506950378, 0.6594399809837341, 0.37571999430656433, 0.09833399951457977, 0.38304001092910767, -0.07688199728727341, -0.2178100049495697, -0.29892000555992126, -0.4945800006389618, 0.09523899853229523, -0.63059002161026, -0.06131099909543991, 0.17767000198364258, -0.14050999283790588, 0.47181999683380127, -0.9589099884033203, 0.04533400014042854, 0.8080000281333923, -0.02686700038611889, -0.27483001351356506, 0.35541000962257385, -0.8289600014686584, -0.7883800268173218, -0.0797320008277893, 0.22940999269485474, -0.45012998580932617, -0.3003999888896942, -0.5271599888801575, 0.11358000338077545, -0.4990600049495697, 0.8270000219345093, -0.5699099898338318, 0.2514300048351288, -0.4026600122451782, -0.2914600074291229, 1.381600022315979, 0.18084000051021576], [-0.1440100073814392, 0.3255400061607361, 0.14257000386714935, -0.09922699630260468, 0.7253599762916565, 0.19321000576019287, -0.24187999963760376, 0.20223000645637512, -0.8959900140762329, 0.1521500051021576, 0.03596299886703491, -0.5951300263404846, -0.051635000854730606, -0.014427999965846539, 0.35475000739097595, -0.318589985370636, 0.7698400020599365, -0.08736900240182877, -0.24762000143527985, 0.6505900025367737, -0.1513800024986267, -0.4270299971103668, 0.18813000619411469, 0.09156200289726257, 0.15192000567913055, 0.11303000152111053, -0.1522199958562851, -0.6278600096702576, -0.23923000693321228, 0.09600900113582611, -0.46147000789642334, 0.41525998711586, -0.304749995470047, 0.1370999962091446, 0.1675799936056137, 0.5330100059509277, -0.043657999485731125, 0.8592399954795837, -0.4119200110435486, -0.21393999457359314, -0.5122799873352051, -0.3194499909877777, 0.12661999464035034, -0.3151000142097473, 0.0031429000664502382, 0.27129000425338745, 0.1732800006866455, -1.3158999681472778, -0.42414000630378723, -0.6912599802017212, 0.019016999751329422, -0.13375000655651093, -0.0960569977760315, 1.7069000005722046, -0.6529099941253662, -2.6110999584198, 0.26517999172210693, -0.6117799878120422, 2.0950000286102295, 0.38148000836372375, -0.5582299828529358, 0.20360000431537628, -0.3370400071144104, 0.3735400140285492, 0.6951000094413757, -0.0016370000084862113, 0.8188499808311462, 0.5179299712181091, 0.2774600088596344, -0.3717699944972992, -0.43345001339912415, -0.4273200035095215, -0.5491200089454651, -0.3071500062942505, 0.18100999295711517, 0.27090001106262207, -0.2926599979400635, 0.30834001302719116, -1.462399959564209, -0.18998999893665314, 0.9227700233459473, -0.0992169976234436, -0.25165000557899475, 0.4919700026512146, -1.524999976158142, 0.1532599925994873, 0.2827000021934509, 0.12101999670267105, -0.3676599860191345, -0.6127499938011169, -0.18884000182151794, 0.10907000303268433, 0.12314999848604202, 0.09006600081920624, -0.6544700264930725, -0.1725199967622757, 2.633599979162682e-05, 0.25398001074790955, 1.107800006866455, -0.07307399809360504], [-0.542639970779419, 0.4147599935531616, 1.0321999788284302, -0.40244001150131226, 0.4669100046157837, 0.2181600034236908, -0.07486400008201599, 0.47332000732421875, 0.08099599927663803, -0.22078999876976013, -0.12807999551296234, -0.1143999993801117, 0.5089100003242493, 0.11568000167608261, 0.028210999444127083, -0.3628000020980835, 0.4382300078868866, 0.04751100018620491, 0.20282000303268433, 0.4985699951648712, -0.10068000108003616, 0.13268999755382538, 0.16971999406814575, 0.11653000116348267, 0.3135499954223633, 0.2571299970149994, 0.09278299659490585, -0.5682600140571594, -0.5297499895095825, -0.05145600065588951, -0.673259973526001, 0.9253299832344055, 0.26930001378059387, 0.2273399978876114, 0.6636499762535095, 0.26221001148223877, 0.19719000160694122, 0.26089999079704285, 0.1877399981021881, -0.34540000557899475, -0.4263499975204468, 0.13975000381469727, 0.5633800029754639, -0.5690699815750122, 0.12398000061511993, -0.12894000113010406, 0.724839985370636, -0.2610499858856201, -0.2631399929523468, -0.4360499978065491, 0.07890799641609192, -0.8414599895477295, 0.5159500241279602, 1.3997000455856323, -0.7645999789237976, -3.1452999114990234, -0.2920199930667877, -0.3124699890613556, 1.5128999948501587, 0.5243499875068665, 0.21456000208854675, 0.42451998591423035, -0.08841100335121155, -0.1780499964952469, 1.187600016593933, 0.10578999668359756, 0.7657099962234497, 0.21913999319076538, 0.358240008354187, -0.11636000126600266, 0.0932610034942627, -0.6248300075531006, -0.21897999942302704, 0.21796000003814697, 0.740559995174408, -0.43735000491142273, 0.14342999458312988, 0.14719000458717346, -1.1605000495910645, -0.05050799995660782, 0.1267700046300888, -0.014395000413060188, -0.9867600202560425, -0.09129700064659119, -1.205399990081787, -0.11974000185728073, 0.047846999019384384, -0.5400099754333496, 0.5245699882507324, -0.709630012512207, -0.32528001070022583, -0.13459999859333038, -0.4131399989128113, 0.33434998989105225, -0.007241200190037489, 0.32253000140190125, -0.0442189984023571, -1.2969000339508057, 0.7621700167655945, 0.46349000930786133], [0.12250000238418579, -0.05883299931883812, 0.2365799993276596, -0.28876999020576477, -0.02818099968135357, 0.3152399957180023, 0.07022900134325027, 0.16447000205516815, -0.027622999623417854, 0.25213998556137085, 0.21174000203609467, -0.05967399850487709, 0.3613300025463104, 0.13606999814510345, 0.18754999339580536, -0.14869999885559082, 0.31314998865127563, 0.13368000090122223, -0.597029983997345, -0.030161000788211823, 0.08065599948167801, 0.2616199851036072, -0.05592399835586548, -0.3535099923610687, 0.3472200036048889, -0.005580100230872631, -0.5793499946594238, -0.8800699710845947, 0.42930999398231506, -0.1569499969482422, -0.5125600099563599, 1.268399953842163, -0.25227999687194824, 0.352649986743927, -0.4641900062561035, 0.5564799904823303, -0.5755599737167358, 0.3257400095462799, -0.21893000602722168, -0.1317799985408783, -1.1026999950408936, -0.039590999484062195, 0.8964300155639648, -0.984499990940094, -0.4739300012588501, -0.1285499930381775, 0.6350600123405457, -0.9488800168037415, 0.40088000893592834, -0.7754200100898743, -0.351529985666275, -0.2778800129890442, 0.687470018863678, 1.4579999446868896, -0.3847399950027466, -2.893699884414673, -0.2952300012111664, -0.38835999369621277, 0.9488099813461304, 1.3890999555587769, 0.05459100008010864, 0.7048599720001221, -0.6569899916648865, 0.0756480023264885, 0.765500009059906, -0.633650004863739, 0.865559995174408, 0.42440998554229736, 0.14796000719070435, 0.4156000018119812, 0.29354000091552734, -0.5129500031471252, 0.19634999334812164, -0.4556800127029419, 0.008024600334465504, 0.14528000354766846, -0.15395000576972961, 0.11405999958515167, -1.2166999578475952, -0.11110000312328339, 0.8263999819755554, 0.21738000214099884, -0.6377599835395813, -0.07487399876117706, -1.7130000591278076, -0.8827000260353088, -0.00730579998344183, -0.37623000144958496, -0.5020899772644043, -0.5884400010108948, -0.24943000078201294, -1.0425000190734863, 0.27678000926971436, 0.6414200067520142, -0.646049976348877, 0.435589998960495, -0.37275999784469604, -0.0032067999709397554, 0.18743999302387238, 0.30702000856399536], [-0.30663999915122986, 0.1682099997997284, 0.9851099848747253, -0.3360599875450134, -0.24160000681877136, 0.16186000406742096, -0.05349599942564964, 0.4300999939441681, 0.573419988155365, -0.07156900316476822, 0.36100998520851135, 0.26728999614715576, 0.27788999676704407, -0.07226800173521042, 0.1383800059556961, -0.2671400010585785, 0.12998999655246735, 0.2294899970293045, -0.18310999870300293, 0.5016300082206726, 0.449209988117218, -0.020820999518036842, 0.4264200031757355, -0.06876199692487717, 0.4033699929714203, 0.09519799798727036, -0.31944000720977783, -0.5465099811553955, -0.1334500014781952, -0.5651100277900696, -0.2097499966621399, 1.1591999530792236, -0.1940000057220459, 0.19828000664710999, -0.11924000084400177, 0.41780999302864075, 0.006838299799710512, -0.2053699940443039, -0.5337499976158142, -0.5222499966621399, -0.3822700083255768, -0.006583299953490496, 0.14264999330043793, -0.4250200092792511, -0.31150001287460327, 0.0027352001052349806, 0.7509300112724304, -0.48217999935150146, -0.18594999611377716, -0.7710400223731995, -0.04640600085258484, -0.0691400021314621, 0.4168800115585327, 1.3235000371932983, -0.8174200057983398, -3.3998000621795654, -0.11307000368833542, -0.34123000502586365, 2.077500104904175, 0.6136900186538696, 0.14791999757289886, 0.937529981136322, -0.10137999802827835, 0.28426000475883484, 0.9789900183677673, -0.3233500123023987, 0.6369699835777283, 0.583079993724823, 0.2282000035047531, -0.31696000695228577, 0.21061000227928162, -0.650600016117096, 0.2165299952030182, -0.2434699982404709, 0.5551900267601013, -0.3435100018978119, -0.09509299695491791, -0.14714999496936798, -1.287600040435791, 0.39309999346733093, 0.3016299903392792, -0.2176699936389923, -1.1145999431610107, 0.5134900212287903, -1.340999960899353, -0.3038100004196167, 0.32499000430107117, -0.45236000418663025, -0.17743000388145447, -0.048503998667001724, -0.12178000062704086, -0.42107999324798584, -0.40327000617980957, 0.03845199942588806, -0.36083999276161194, 0.037737999111413956, -0.2188500016927719, -0.3877499997615814, 0.369159996509552, 0.5452100038528442], [-0.13128000497817993, -0.4519999921321869, 0.04339899867773056, -0.997979998588562, -0.21052999794483185, -0.9586799740791321, -0.24608999490737915, 0.48412999510765076, 0.18177999556064606, 0.4749999940395355, -0.22304999828338623, 0.3006399869918823, 0.4349600076675415, -0.3605000078678131, 0.2024500072002411, -0.5259400010108948, -0.3470799922943115, 0.007587300147861242, -1.0497000217437744, 0.18672999739646912, 0.5736899971961975, 0.43814000487327576, 0.09865900129079819, 0.38769999146461487, -0.22579999268054962, 0.4191100001335144, 0.043602000921964645, -0.7351999878883362, -0.535830020904541, 0.19276000559329987, -0.21961000561714172, 0.4251500070095062, -0.19081999361515045, 0.4718700051307678, 0.1882600039243698, 0.13357000052928925, 0.4183900058269501, 1.3137999773025513, 0.3567799925804138, -0.3217200040817261, -1.2257000207901, -0.26635000109672546, 0.36715999245643616, -0.2758600115776062, -0.5324599742889404, 0.1678600013256073, -0.11253000050783157, -0.9995899796485901, -0.6070600152015686, -0.8927099704742432, 0.6515600085258484, -0.8878399729728699, 0.049233000725507736, 0.6711099743843079, -0.27553001046180725, -2.4005000591278076, -0.3698900043964386, 0.2913599908351898, 1.3497999906539917, 1.7352999448776245, 0.27000001072883606, 0.021299000829458237, 0.1442199945449829, 0.023784000426530838, 0.33643001317977905, -0.35475999116897583, 1.0921000242233276, 1.4845000505447388, 0.4943000078201294, 0.15688000619411469, 0.34678998589515686, -0.5722100138664246, 0.12093000113964081, -1.2616000175476074, 1.0541000366210938, 0.06433500349521637, -0.002732000080868602, 0.1903800070285797, -1.764299988746643, 0.0550680011510849, 1.4737000465393066, -0.417820006608963, -0.573419988155365, -0.12128999829292297, -1.3169000148773193, -0.7388299703598022, 0.17681999504566193, -0.01999099925160408, -0.4917599856853485, -0.5524700284004211, 1.0622999668121338, -0.628790020942688, 0.2909800112247467, 0.13237999379634857, -0.7041400074958801, 0.671280026435852, -0.08546199649572372, -0.3052600026130676, -0.04549499973654747, 0.565090000629425], [-0.15730999410152435, -0.7550299763679504, 0.36844998598098755, -0.18957999348640442, -0.16896000504493713, -0.23157000541687012, -0.22657999396324158, -0.3018600046634674, 0.24371999502182007, 0.6189600229263306, 0.5899500250816345, 0.047637999057769775, -0.055163998156785965, -0.7021099925041199, 0.22084000706672668, -0.6923199892044067, 0.4941900074481964, 1.4285000562667847, -0.2536199986934662, 0.20031000673770905, -0.2619200050830841, 0.0531499981880188, -0.04841800034046173, -0.44982001185417175, 0.5464400053024292, -0.014644999988377094, -0.01553099974989891, -0.6119700074195862, -0.9196400046348572, -0.7527999877929688, 0.6484299898147583, 1.093400001525879, 0.052682001143693924, 0.33344998955726624, 0.10531999915838242, 0.5951700210571289, 0.023104000836610794, -0.37105000019073486, 0.2974900007247925, -0.2368299961090088, 0.07956600189208984, -0.10326000303030014, 0.35885000228881836, -0.2893500030040741, -0.19880999624729156, 0.22908000648021698, -0.061434999108314514, 0.561269998550415, -0.017115000635385513, -0.32868000864982605, -0.7841699719429016, -0.4937500059604645, 0.3494400084018707, 0.1627800017595291, -0.06116800010204315, -1.3106000423431396, 0.3915199935436249, 0.12399999797344208, -0.20872999727725983, -0.18472999334335327, -0.5618399977684021, 0.5569300055503845, 0.01211399957537651, -0.54544997215271, -0.3140900135040283, 0.10000000149011612, 0.3154299855232239, 0.7475699782371521, -0.4773400127887726, -0.18332000076770782, -0.6562299728393555, 0.4076800048351288, -0.3069700002670288, -0.4724699854850769, -0.7421000003814697, -0.4497799873352051, -0.07812199741601944, -0.5267300009727478, -0.7063300013542175, 1.3271000385284424, 0.26298001408576965, -0.9100000262260437, 0.9163200259208679, -0.5164300203323364, 0.20284000039100647, -0.25402000546455383, -1.256600022315979, 0.20271000266075134, 0.9210500121116638, -0.5757399797439575, -0.15105000138282776, -0.24830999970436096, 0.3667300045490265, -0.539870023727417, 0.1853400021791458, 0.2571299970149994, 0.387939989566803, -0.5413699746131897, 0.6781700253486633, -0.17250999808311462], [-0.4360800087451935, 0.39103999733924866, 0.516569972038269, -0.13861000537872314, 0.2029000073671341, 0.5072299838066101, -0.012543999589979649, 0.22947999835014343, -0.631600022315979, 0.21198999881744385, -0.018043000251054764, -0.39364001154899597, 0.7416399717330933, 0.3022100031375885, 0.5179200172424316, -0.251910001039505, 0.25372999906539917, -0.6518399715423584, -0.42963001132011414, 0.009362200275063515, 0.023334000259637833, -0.3924500048160553, 0.349480003118515, 0.21217000484466553, 0.7346000075340271, -0.2196200042963028, -0.02861100062727928, -0.34641000628471375, -0.20934000611305237, -0.27090999484062195, -0.17636999487876892, 0.82396000623703, -0.08233900368213654, -0.0348690003156662, 0.07972200214862823, 0.3484100103378296, 0.6088700294494629, 0.22811000049114227, -0.2963300049304962, 0.18633000552654266, 0.23399999737739563, -0.709659993648529, 0.16312000155448914, -0.20857000350952148, 0.09236899763345718, -0.07543499767780304, -0.13905000686645508, -0.35120999813079834, -0.19971999526023865, -0.41686999797821045, -0.31485000252723694, 0.16122999787330627, 0.038881998509168625, 1.6654000282287598, -0.12400999665260315, -3.341900110244751, 0.1092899963259697, -0.02619899995625019, 1.24399995803833, 0.8437399864196777, -0.15679000318050385, 0.7904099822044373, -0.042433001101017, 0.18884000182151794, 0.06434500217437744, -0.1168299987912178, 1.0467000007629395, 0.7181299924850464, 0.5783399939537048, 0.27013999223709106, -0.5090799927711487, -0.08399499952793121, -0.1437000036239624, -0.7640799880027771, 0.27417999505996704, 0.5681399703025818, -0.39375001192092896, -0.32558000087738037, -0.9285399913787842, -0.1309799998998642, 1.3277000188827515, 0.11851000040769577, -0.15550999343395233, 0.5971999764442444, -1.0839999914169312, -0.05813699960708618, 0.23885999619960785, 0.145579993724823, -0.5930299758911133, -0.4751099944114685, -0.22064000368118286, -0.3759100139141083, -0.7964900135993958, 0.013465000316500664, -0.4459500014781952, -0.34623000025749207, -0.7539799809455872, -0.3517000079154968, 0.9945600032806396, 0.08819600194692612], [0.1371700018644333, -0.5428699851036072, 0.19418999552726746, -0.2995299994945526, 0.17544999718666077, 0.0846719965338707, 0.6775199770927429, 0.09829500317573547, -0.035610999912023544, 0.21333999931812286, 0.5166299939155579, 0.20687000453472137, 0.44082000851631165, -0.3365499973297119, 0.5602499842643738, -0.6879000067710876, 0.519569993019104, -0.21257999539375305, -0.5270799994468689, -0.12249000370502472, 0.3309899866580963, 0.026448000222444534, 0.5900700092315674, 0.006546900141984224, 0.4540500044822693, -0.3388400077819824, -0.2826099991798401, -0.24632999300956726, 0.10847000032663345, 0.3163999915122986, -0.1536799967288971, 0.7350299954414368, 0.11857999861240387, 0.7084199786186218, 0.0750809982419014, 0.2973800003528595, -0.11394999921321869, 0.40806999802589417, -0.04253099858760834, -0.2130099982023239, -0.7984899878501892, -0.12703000009059906, 0.7519999742507935, -0.41745999455451965, 0.4661499857902527, -0.039096999913454056, 0.6596099734306335, -0.32335999608039856, 0.44200000166893005, -0.9413700103759766, -0.23125000298023224, -0.3060399889945984, 0.7991200089454651, 1.4580999612808228, -0.8819900155067444, -3.0041000843048096, -0.7524300217628479, -0.20502999424934387, 1.1998000144958496, 0.9488099813461304, 0.3064900040626526, 0.4841099977493286, -0.7572000026702881, 0.6585599780082703, 0.7010700106620789, -0.931410014629364, 0.5292800068855286, 0.23322999477386475, 0.18856999278068542, 0.38690999150276184, 0.011489000171422958, -0.31937000155448914, 0.011858000420033932, 0.22944000363349915, 0.17764000594615936, 0.16867999732494354, 0.14002999663352966, 0.5864700078964233, -1.544700026512146, -0.06442499905824661, -0.0006471099914051592, 0.13605999946594238, -0.3269500136375427, 0.10042999684810638, -1.5460000038146973, -0.5475999712944031, 0.2102700024843216, -0.6719499826431274, -0.15970000624656677, -0.6827099919319153, -0.22043000161647797, -0.8708800077438354, -0.16247999668121338, 0.8308600187301636, -0.23045000433921814, 0.19864000380039215, -0.0518920011818409, -0.5205699801445007, 0.2543399930000305, -0.2375900000333786], [-0.327210009098053, 0.09644600003957748, 0.34244000911712646, -0.4432699978351593, 0.30535000562667847, -0.04201599955558777, -0.07123500108718872, -0.31036001443862915, -0.22556999325752258, -0.1809999942779541, -0.2908799946308136, -0.6154199838638306, 0.2975099980831146, 0.030491000041365623, 0.415039986371994, -0.5148900151252747, 0.6862800121307373, -0.020301999524235725, -0.1848600059747696, 0.3160499930381775, 0.5947200059890747, -0.21469999849796295, 0.29256001114845276, 0.43261998891830444, 0.3546600043773651, -0.29659000039100647, -0.2708599865436554, -0.4895299971103668, -0.047391001135110855, 0.24521000683307648, -0.15782999992370605, 0.5974199771881104, -0.4166400134563446, 0.057631999254226685, 0.12330000102519989, 0.6232600212097168, -0.08844000101089478, 0.3077000081539154, -0.15741999447345734, -0.28380998969078064, -0.5805799961090088, -0.0228240005671978, 0.2668899893760681, -0.22564999759197235, 0.47547999024391174, 0.1113400012254715, 0.3726300001144409, -0.1455399990081787, -0.16775000095367432, -0.7937700152397156, -0.3059299886226654, -0.10671000182628632, 0.4419899880886078, 1.5698000192642212, -0.7306200265884399, -2.7314000129699707, -0.19366000592708588, -0.32982999086380005, 1.288100004196167, 0.6212599873542786, -0.2549999952316284, 0.8416000008583069, -0.2365799993276596, 0.42594000697135925, 0.8658900260925293, -0.3590399920940399, 0.7816200256347656, 0.20396000146865845, 0.828980028629303, 0.0016123000532388687, -0.24007999897003174, -0.7273499965667725, -0.05367099866271019, -0.2226399928331375, 0.3103399872779846, -0.21243000030517578, -0.1433500051498413, 0.31700000166893005, -0.8047800064086914, -0.4931100010871887, 0.8802300095558167, -0.24146999418735504, -0.3921999931335449, 0.1599700003862381, -1.5853999853134155, -0.2582400143146515, 0.05283400043845177, -0.11982999742031097, -0.018874000757932663, -0.7735599875450134, 0.04928499832749367, -0.25332000851631165, -0.30730000138282776, 0.5129500031471252, -0.5680199861526489, -0.2123900055885315, -0.39741000533103943, -0.38165000081062317, 0.4399400055408478, 0.24683000147342682], [0.12883000075817108, -0.8220900297164917, 0.27437999844551086, -0.06901399791240692, 0.1798900067806244, 0.7260500192642212, -0.15112000703811646, 0.008554100058972836, -0.9512199759483337, 0.7724300026893616, -0.2837499976158142, 0.28328999876976013, 0.14824999868869781, -0.012230000458657742, -0.019267000257968903, -0.034460000693798065, 0.31505998969078064, -0.16639000177383423, -0.013434999622404575, -0.002045900095254183, 0.06490500271320343, -0.2098899930715561, 0.1252399981021881, 0.3522999882698059, 0.6403999924659729, 0.05956999957561493, -0.8030200004577637, -0.8164799809455872, 0.6613399982452393, 0.05996999889612198, -0.061521001160144806, 0.8492199778556824, -0.02873300015926361, 0.2766999900341034, -1.0068000555038452, 0.7175800204277039, -0.3725700080394745, 0.43064001202583313, -0.49243998527526855, 0.38683000206947327, -0.36827999353408813, 0.02798200026154518, 1.534600019454956, -0.6053299903869629, -0.3444899916648865, -0.17069000005722046, 0.29287999868392944, -0.5358099937438965, 0.5603500008583069, -0.6301299929618835, -0.12308000028133392, 0.0936330035328865, 0.5933600068092346, 1.521399974822998, -0.09262900054454803, -3.1407999992370605, 0.13931000232696533, -0.5382000207901001, 1.1735999584197998, 0.6231799721717834, 0.4362100064754486, 1.285599946975708, 0.1212100014090538, 0.46206000447273254, 0.5614200234413147, -0.4143899977207184, 0.9435999989509583, 0.3895399868488312, -0.05315599963068962, 0.18622000515460968, -0.1878499984741211, 0.37602999806404114, 0.13877999782562256, -1.288100004196167, 0.1853400021791458, 0.3515700101852417, -0.8088799715042114, -0.06766200065612793, -1.1934000253677368, 0.2009499967098236, 0.9629700183868408, 0.920740008354187, -0.030933000147342682, -0.11743000149726868, -1.5210000276565552, -0.7753900289535522, -0.09117799997329712, -0.12773999571800232, -0.6395800113677979, -0.6809899806976318, -0.16037000715732574, -0.21731999516487122, 0.5708799958229065, 0.8668799996376038, -0.6785100102424622, -0.606410026550293, -0.68927001953125, -0.3396100103855133, 0.42743000388145447, 0.16574999690055847], [-0.20874999463558197, -0.11739999800920486, 0.2647800147533417, -0.28338998556137085, 0.1958400011062622, 0.7445999979972839, -0.03886999934911728, 0.028498999774456024, -0.44251999258995056, -0.3042599856853485, 0.27132999897003174, -0.519070029258728, 0.5218300223350525, -0.766480028629303, 0.28042998909950256, -0.48344001173973083, -0.15625999867916107, -0.4970499873161316, -0.5102400183677673, -0.03652000054717064, 0.20578999817371368, -0.6136000156402588, 0.4638800024986267, 0.734969973564148, 0.6681299805641174, -0.44429999589920044, -0.1760299950838089, -0.5478000044822693, -0.013520999811589718, 0.16333000361919403, 0.28148001432418823, 0.05422300100326538, -0.19905999302864075, -0.1906999945640564, -0.43178999423980713, 0.14780999720096588, 0.2755500078201294, 0.18570999801158905, -0.40775999426841736, -0.15414999425411224, -0.5885000228881836, -0.008528100326657295, -0.14178000390529633, 0.7060999870300293, 0.5403100252151489, -0.4330500066280365, 0.17497000098228455, -0.4620800018310547, -0.3137199878692627, -0.34038999676704407, -0.2512800097465515, 0.6822800040245056, 0.3357599973678589, 1.5861999988555908, -0.39427000284194946, -2.993799924850464, -0.2977299988269806, 0.0421300008893013, 1.9075000286102295, -0.07262799888849258, -0.09219100326299667, 0.661329984664917, 0.13867999613285065, 0.7877399921417236, 0.6930699944496155, -0.22184999287128448, 0.7170500159263611, 1.145300030708313, 1.2152999639511108, 0.1419599950313568, -0.7991399765014648, 0.16965000331401825, -0.3453199863433838, -0.5174199938774109, -0.15647999942302704, 0.1875700056552887, 0.16940000653266907, -0.008271300233900547, -1.4510999917984009, 0.06198300048708916, 1.1018999814987183, 0.08441100269556046, -0.34147998690605164, 0.49994000792503357, -1.1105999946594238, -0.13759000599384308, 0.15376999974250793, -0.06100599840283394, -0.5382599830627441, -0.7894099950790405, -0.1256600022315979, -0.5738099813461304, -0.7348399758338928, 0.5477399826049805, -0.2845500111579895, -0.24347999691963196, -0.27511000633239746, -0.3326700031757355, 0.2787800133228302, -0.8705000281333923], [0.09373600035905838, 0.561519980430603, 0.48363998532295227, -0.45987001061439514, 0.560670018196106, -0.16940000653266907, 0.01868700049817562, 0.4552899897098541, 0.06561499834060669, 0.2518100142478943, -0.14250999689102173, 0.10531999915838242, 0.7786499857902527, 0.1428000032901764, -0.08113999664783478, -0.06955499947071075, 0.32433000206947327, 0.019610999152064323, -0.1560799926519394, 0.22235000133514404, 0.35558998584747314, 0.14712999761104584, 0.19156000018119812, 0.28029999136924744, 0.2769100069999695, -0.20669999718666077, -0.11377999931573868, -0.4831799864768982, -0.6424800157546997, -0.3552300035953522, 0.21939000487327576, 1.2532999515533447, -0.21164000034332275, 0.9181100130081177, 0.3198600113391876, 0.4836699962615967, 0.15321999788284302, 0.5610899925231934, -0.6069200038909912, -0.028075000271201134, -0.9219899773597717, -0.25582998991012573, 0.6636199951171875, -0.4908199906349182, 0.34757000207901, -0.04810300096869469, 0.5728300213813782, -0.6233199834823608, 0.8750799894332886, -0.500789999961853, -0.1231599971652031, -0.6909599900245667, 0.10129000246524811, 1.5160000324249268, -0.17399999499320984, -2.890199899673462, -0.2454099953174591, -0.17934000492095947, 1.100100040435791, 1.419800043106079, 0.49132001399993896, 0.30281999707221985, 0.07714899629354477, -0.09783399850130081, 0.9058600068092346, -0.1615000069141388, 0.5568100214004517, 0.3281700015068054, 0.49334999918937683, 0.044815000146627426, 0.5745800137519836, -0.32662999629974365, -0.2974500060081482, 0.0018070000223815441, 0.24381999671459198, -0.5191500186920166, -0.14392000436782837, 0.27921000123023987, -1.5964000225067139, 0.3715200126171112, 0.8112900257110596, -0.13488000631332397, -0.365339994430542, -0.022345999255776405, -1.5090999603271484, -0.3872700035572052, 0.30063000321388245, -0.3756200075149536, -0.18581999838352203, -0.3974800109863281, -0.10718999803066254, -0.12264999747276306, -0.6646199822425842, 0.12111999839544296, -0.3728100061416626, 0.6004800200462341, -0.426829993724823, -0.8130499720573425, 0.6239699721336365, 0.7317600250244141], [-0.46952998638153076, 0.3843199908733368, 0.5483300089836121, -0.6340100169181824, 0.01013300009071827, 0.11364000290632248, 0.10611999779939651, 0.5852900147438049, 0.032301999628543854, -0.1227400004863739, 0.030264999717473984, 0.5266199707984924, 1.0398000478744507, -0.08214300125837326, 0.1911800056695938, -0.8378400206565857, 0.5076299905776978, 0.44488000869750977, -0.7260400056838989, 0.03689299896359444, 0.2421099990606308, -0.28878000378608704, 0.33656999468803406, 0.13655999302864075, 0.1457899957895279, -0.13221000134944916, 0.09842800348997116, -0.4527600109577179, -0.13029000163078308, 0.015761999413371086, -0.010161000303924084, 0.4966999888420105, -0.28461000323295593, 0.2965500056743622, 0.9297900199890137, 0.4244700074195862, -0.08277300000190735, 0.30437999963760376, -0.39219000935554504, -0.30584999918937683, -0.4320099949836731, -0.2733300030231476, 0.2438800036907196, -0.580810010433197, 0.22678999602794647, 0.027225999161601067, 0.5347300171852112, -0.3752700090408325, -0.161190003156662, -1.1234999895095825, 0.1276800036430359, -0.6989799737930298, 0.4134100079536438, 1.229099988937378, -0.4124799966812134, -2.5172998905181885, -0.1535400003194809, -0.04310699924826622, 1.9111000299453735, 0.8075399994850159, -0.14758999645709991, 0.9609000086784363, -0.8426700234413147, 0.08442199975252151, 1.2616000175476074, -0.10937999933958054, 0.5484600067138672, 0.7525500059127808, -0.07128900289535522, -0.739870011806488, 0.09480799734592438, -0.9758899807929993, 0.007872099988162518, -0.23928000032901764, 0.2881999909877777, -0.41516000032424927, 0.034366000443696976, 0.11969999969005585, -1.2142000198364258, -0.11305999755859375, 0.528469979763031, -0.4227299988269806, -0.9337800145149231, -0.04664500057697296, -2.121999979019165, -0.3409999907016754, 0.6422899961471558, -0.10097000002861023, -0.22875000536441803, -1.0776000022888184, -0.6804400086402893, -0.26372000575065613, -0.18331000208854675, -0.051631998270750046, -0.3083600103855133, 0.06653700023889542, 0.2042199969291687, -0.6891400218009949, 0.4510999917984009, 0.2512499988079071], [0.15711000561714172, 0.656059980392456, 0.0021148999221622944, -0.6514400243759155, -0.2842699885368347, -0.20369000732898712, -0.07759600132703781, 0.4079799950122833, -0.03446999937295914, -0.1639000028371811, -0.2159699946641922, 0.34178000688552856, 1.1959999799728394, 0.3363899886608124, -0.2107599973678589, -0.5601500272750854, 0.15070000290870667, 0.34911999106407166, -0.9712799787521362, 0.1815200001001358, 0.7440800070762634, 0.2002899944782257, 0.6698600053787231, 0.16085000336170197, -0.0013507000403478742, -0.5539199709892273, 0.19411000609397888, -0.480430006980896, -0.2977699935436249, -0.5076500177383423, 0.801639974117279, 0.5042399764060974, -0.405239999294281, 0.5399100184440613, 0.6568599939346313, 0.21140000224113464, 0.18574999272823334, 0.8069700002670288, -0.20066000521183014, 0.09571400284767151, -0.5889899730682373, -0.3590700030326843, 0.2716200053691864, -0.5179399847984314, 0.23469999432563782, -0.04599900171160698, 0.5650100111961365, -0.4074699878692627, 0.6337699890136719, -0.9226599931716919, -0.0234179999679327, -0.25040000677108765, -0.19575999677181244, 1.386299967765808, 0.08731400221586227, -2.2309000492095947, 0.15083999931812286, -0.18660999834537506, 1.2920000553131104, 1.3258999586105347, -0.301800012588501, 1.2553999423980713, -0.41593998670578003, 0.04508199915289879, 1.2568999528884888, 0.19147999584674835, 0.531440019607544, 0.5490400195121765, 0.1633100062608719, -0.665090024471283, 0.1179800033569336, -0.5249800086021423, -0.08462300151586533, -0.5586599707603455, -0.44293999671936035, -0.19598999619483948, -0.17698000371456146, 0.3181000053882599, -1.4736000299453735, 0.2629300057888031, 0.963670015335083, -0.2546299993991852, -0.707859992980957, -0.11712999641895294, -2.350800037384033, -0.4738599956035614, 0.5625799894332886, -0.0799650028347969, -0.6985599994659424, -0.48524001240730286, -0.330810010433197, -0.1920499950647354, -0.4969500005245209, -0.32642999291419983, -0.9720699787139893, 0.21092000603675842, -0.5808200240135193, -0.6061499714851379, 0.7100499868392944, 0.4146899878978729], [-0.19103999435901642, 0.17600999772548676, 0.3691999912261963, 